tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
#define USART_BAUD 115200
#define USART_BUFFER_SIZE 128

static void put_char(uint8_t byte)
{
#ifdef STM32F103xB
    USART1->DR = (int)(byte);
    while (!(USART1->SR & USART_SR_TXE));
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    USART1->RDR = (int)(byte);
    while (!(USART1->ISR & USART_ISR_TXE));
#endif  // #ifdef STM32F767xx
}

typedef struct {
    uint8_t buffer[USART_BUFFER_SIZE];
    uint8_t head_pos;
    uint8_t tail_pos;
} rx_buffer_t;

volatile rx_buffer_t uart_buffer = { { 0 }, 0, 0 };

static void buffer_char(uint8_t c)
{
    __disable_irq();

    int i = (uart_buffer.head_pos + 1) % USART_BUFFER_SIZE;
    
    if (i != uart_buffer.tail_pos) {
        uart_buffer.buffer[uart_buffer.head_pos] = c;
        uart_buffer.head_pos = i;
    }

    __enable_irq();
}

static uint8_t get_char(uint8_t *c)
{
    __disable_irq();

    if(uart_buffer.head_pos == uart_buffer.tail_pos) {
        __enable_irq();
        return 0;
    }
    
    *c = uart_buffer.buffer[uart_buffer.tail_pos];
    uart_buffer.tail_pos = (uart_buffer.tail_pos + 1) % USART_BUFFER_SIZE;
    
    __enable_irq();
    return 1;
}

volatile uint32_t *DWT_CYCCNT = (uint32_t *)0xE0001004;

static void parse(void);
static void set_current_run_mode(run_mode mode);

#ifdef __cplusplus
extern "C" {
#endif  // #ifdef __cplusplus

void HardFault_Handler(void)
{
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
}

void BusFault_Handler(void)
{
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
}

void SysTick_Handler(void)
{
    absolute_tick++;
    
    parse();

    led_delay_count = ( (led_delay_count + 1) % LED_DELAY_MS );
    if(led_delay_count == 0) {
        led_state       = led_state_next;
        led_state_next  = led_idle;
    }
    
    IWDG->KR  = 0xAAAA;
}

void USART1_IRQHandler(void)
{
#ifdef STM32F103xB
    uint8_t in_char = (USART1->DR & 0xFF);
    buffer_char(in_char);
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    uint8_t in_char = (USART1->RDR & 0xFF);
    buffer_char(in_char);
#endif  // #ifdef STM32F767xx
}

void EXTI1_IRQHandler(void)
{
    // Core critical section, nothing shall happen here
    __disable_irq();
    int16_t cnt = TIM3->CNT;
    TIM3->CNT = 0;

    absolute_pos += cnt;

    if (cnt < 0) {
        absolute_idx--;
    } else {
        absolute_idx++;
    }

    EXTI->PR |= EXTI_PR_PR1;

    if (cnt == 2880 || cnt == -2880) {
        index_zero_occured = 1;
    }

    static int32_t last_absolute_tick = 0;
    current_index_delta = abs(absolute_tick - last_absolute_tick);
    last_absolute_tick = absolute_tick;
    __enable_irq();
}

static struct cycle_buffer {

	struct cycle_entry {
		uint8_t target_axs;
		uint8_t wait_for_index_zero;
		uint16_t dummy;
		int32_t target_pos;
		int32_t stepper_mul_z;
		int32_t stepper_div_z;
		int32_t stepper_mul_x;
		int32_t stepper_div_x;
		int32_t stepper_mul_d;
		int32_t stepper_div_d;
	};

	void reset() {
		buf_pos = 0;
		buf_index = 0;
		next();
	}

	void clear() {
		buf_pos = 0;
		buf_len = 0;
		buf_index = 0;
		buf_index_length = 0;
	}
	
	const cycle_entry &current() const {
		return entry;
	}
	
	uint32_t index() const {
		return buf_index - 1;
	}

	uint32_t index_length() const {
		return buf_index_length;
	}
	
	bool empty() const {
		return buf_len == 0;
	}
	
	bool atend() const {
		return buf_pos >= buf_len;
	}
	
	bool atlimit() const {
		return buf_len >= (sizeof(buf) - sizeof(entry));
	}
	
	void next() {
		uint8_t flags = buf[buf_pos++];
		
		entry.target_axs = flags & 0x03;
		entry.wait_for_index_zero = flags & 0x20;

		entry.target_pos = read_int32();

		if (flags & 0x04) {
			entry.stepper_mul_z = read_int32();
			entry.stepper_div_z = read_int32();
		} else {
			entry.stepper_mul_z = 0;
			entry.stepper_div_z = 0;
		}
		if (flags & 0x08) {
			entry.stepper_mul_x = read_int32();
			entry.stepper_div_x = read_int32();
		} else {
			entry.stepper_mul_x = 0;
			entry.stepper_div_x = 0;
		}
		if (flags & 0x10) {
			entry.stepper_mul_d = read_int32();
			entry.stepper_div_d = read_int32();
		} else {
			entry.stepper_mul_d = 0;
			entry.stepper_div_d = 0;
		}
		
		buf_index ++;
	}

	void push(const cycle_entry &entry) {
		uint8_t flags = entry.target_axs;

		if (entry.stepper_mul_z || entry.stepper_div_z) {
			flags |= 0x04;
		}
		if (entry.stepper_mul_x || entry.stepper_div_x) {
			flags |= 0x08;
		}
		if (entry.stepper_mul_d || entry.stepper_div_d) {
			flags |= 0x10;
		}

		flags |= entry.wait_for_index_zero ? 0x20 : 0;
		
		buf[buf_len++] = flags;
		
		write_int32(entry.target_pos);
		
		if (entry.stepper_mul_z || entry.stepper_div_z) {
			write_int32(entry.stepper_mul_z);
			write_int32(entry.stepper_div_z);
		}

		if (entry.stepper_mul_x || entry.stepper_div_x) {
			write_int32(entry.stepper_mul_x);
			write_int32(entry.stepper_div_x);
		}

		if (entry.stepper_mul_d || entry.stepper_div_d) {
			write_int32(entry.stepper_mul_d);
			write_int32(entry.stepper_div_d);
		}
		
		buf_index_length++;
	}
	
private:

	int32_t read_int32() {
		int32_t res = int32_t((buf[buf_pos+0] << 24) | 
							  (buf[buf_pos+1] << 16) | 
							  (buf[buf_pos+2] <<  8) | 
							  (buf[buf_pos+3] <<  0)); 
		buf_pos += 4;
		return res;
	}
	
	void write_int32(int32_t val) {
		buf[buf_len++] = (uint32_t(val) >> 24) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >> 16) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  8) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  0) & 0xFF;
	}

	cycle_entry entry;

#ifdef STM32F103xB
	uint8_t buf[16384];
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
	uint8_t buf[262144];
#endif  // #ifdef STM32F767xx

	uint32_t buf_index;
	uint32_t buf_index_length;

	uint32_t buf_pos;
	uint32_t buf_len;
} cycle_buffer;

static inline void calc_step(int32_t &stepper_target_pos, int32_t absolute_actual_pos, int32_t stepper_follow_mul, int32_t stepper_follow_div, int32_t stepper_off) {
	if (stepper_follow_mul == 0) {
		stepper_target_pos = stepper_off;      
	} else {
		int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul);
		int32_t v = stepper_follow_div;
		stepper_target_pos = divls(int32_t(u>>32),uint32_t(u), v); 
		stepper_target_pos += stepper_off;
	}
}

static inline void reload_cycle() {
	auto &e = cycle_buffer.current();
	
	stepper_target_axis = e.target_axs;

	stepper_follow_mul_z = e.stepper_mul_z;
	stepper_follow_mul_x = e.stepper_mul_x;
	stepper_follow_mul_d = e.stepper_mul_d;

	stepper_follow_div_z = e.stepper_div_z;
	stepper_follow_div_x = e.stepper_div_x;
	stepper_follow_div_d = e.stepper_div_d;

	stepper_end_pos_z = 0;
	stepper_end_pos_x = 0;
	stepper_end_pos_d = 0;

	switch(e.target_axs) {
		case 0: {
			stepper_end_pos_z = e.target_pos;
		} break;
		case 1: {
			stepper_end_pos_x = e.target_pos;
		} break;
		case 2: {
			stepper_end_pos_d = e.target_pos;
		} break;
	}

	if (e.wait_for_index_zero) {
		wait_for_index_zero = 1;
		index_zero_occured = 0;
	}
}

