tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
                case 'C': {
                            static int32_t prev_target_z = 0;
                            static int32_t prev_target_x = 0;
                            static int32_t prev_target_d = 0;

                            size_t pos = 1;
                            bool ok_to_run = true;

                            if (buf_pos < (1 + 1 + size_of_crc)) {
                                send_invalid_response();
                                break;
                            }

                            if (buf[pos] != 'X' && 
                                buf[pos] != 'Z' &&
                                buf[pos] != 'D' &&
                                buf[pos] != 'S' && 
                                buf[pos] != 'R' && 
                                buf[pos] != 'P') {
                                ok_to_run = false;
                                send_invalid_response();
                                break;
                            }

                            if (buf[pos] == 'S') {
                            	cycle_buffer.reset();
                                if (cycle_buffer.empty() ||
                                    cycle_buffer.atend()) {
                                    send_invalid_response();
                                    break;
                                }
                                reload_cycle();
                                set_zero_pos();
                                set_current_run_mode(run_mode_cycle);
                                send_ok_response();
                                break;
                            }

                            if (buf[pos] == 'P') {
                                set_current_run_mode(run_mode_cycle_pause);
                                send_ok_response();
                                break;
                            }

                            set_current_run_mode(run_mode_none);

                            if (buf[pos] == 'R') {
                            	cycle_buffer.clear();
                                prev_target_z = 0;
                                prev_target_x = 0;
                                prev_target_d = 0;
                                send_ok_response();
                                break;
                            }


                            if (buf_pos < (1 + 1 + size_of_crc + 64)) {
                                send_invalid_response();
                                break;
                            }

                            cycle_buffer::cycle_entry entry;
                            entry.target_axs = (buf[pos] == 'X') ? 1 : ( (buf[pos] == 'D') ? 2 : 0); pos++;
							
                            uint32_t val = 0;
							sscanf(&buf[pos],"%08x",(unsigned int *)&val); entry.target_pos = val; pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_mul_z); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_div_z); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_mul_x); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_div_x); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_mul_d); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&entry.stepper_div_d); pos += 8;
							sscanf(&buf[pos],"%08x",(unsigned int *)&val); entry.wait_for_index_zero = val; pos += 8;

                            entry.stepper_mul_z = -entry.stepper_mul_z;
                            entry.stepper_mul_x = -entry.stepper_mul_x;
                            entry.stepper_mul_d = -entry.stepper_mul_d;

                            if (entry.stepper_div_z <= 0 ||
                                entry.stepper_div_x <= 0 ||
                                entry.stepper_div_d <= 0) {
                                ok_to_run = false;
                            }

                            int32_t gcd_z = gcd(entry.stepper_mul_z, entry.stepper_div_z); entry.stepper_mul_z /= gcd_z; entry.stepper_div_z /= gcd_z;
                            int32_t gcd_x = gcd(entry.stepper_mul_x, entry.stepper_div_x); entry.stepper_mul_x /= gcd_x; entry.stepper_div_x /= gcd_x;
                            int32_t gcd_d = gcd(entry.stepper_mul_d, entry.stepper_div_d); entry.stepper_mul_d /= gcd_d; entry.stepper_div_d /= gcd_d;

                            switch(entry.target_axs) {
                                case 0: {
                                    if (entry.stepper_mul_z < 0 && entry.target_pos <= prev_target_z) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_z > 0 && entry.target_pos >= prev_target_z) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_z == 0 && entry.target_pos != prev_target_z) {
                                        ok_to_run = false;
                                    }
                                } break;
                                case 1: {
                                    if (entry.stepper_mul_x < 0 && entry.target_pos <= prev_target_x) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_x > 0 && entry.target_pos >= prev_target_x) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_x == 0 && entry.target_pos != prev_target_x) {
                                        ok_to_run = false;
                                    }
                                } break;
                                case 2: {
                                    if (entry.stepper_mul_d < 0 && entry.target_pos <= prev_target_d) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_d > 0 && entry.target_pos >= prev_target_d) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_d == 0 && entry.target_pos != prev_target_d) {
                                        ok_to_run = false;
                                    }
                                } break;
                            }

							switch(entry.target_axs) {
								case 0: {
									prev_target_z = entry.target_pos; 
								} break;
								case 1: {
									prev_target_x = entry.target_pos; 
								} break;
								case 2: {
									prev_target_d = entry.target_pos; 
								} break;
							}

							// push cycle
							cycle_buffer.push(entry);

                            if (cycle_buffer.atlimit()) {
                                ok_to_run = false;
                            }
							
                            if (ok_to_run) {
                                send_ok_response();
                            } else {
                            	cycle_buffer.clear();
								send_invalid_response();
                            }
                        } break;

                // Reset to zero
                case 'R': {
                            set_zero_pos();
                            send_ok_response();
                        } break;

                // Get raw status
                case 'S': {
                            int16_t cnt = TIM3->CNT;

                            char sts[256];
                            size_t pos = 0;
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_pos + cnt)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_actual_pos_z)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_actual_pos_x)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_actual_pos_d)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(cnt)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_idx)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(current_index_delta)); pos += 8; 
                            if (current_run_mode == run_mode_cycle) {
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(cycle_buffer.current().target_pos)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(cycle_buffer.current().stepper_mul_z)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(cycle_buffer.current().stepper_div_z)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(cycle_buffer.current().stepper_mul_x)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(cycle_buffer.current().stepper_div_x)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(cycle_buffer.current().stepper_mul_d)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(cycle_buffer.current().stepper_div_d)); pos += 8; 
                            } else {
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_pos_start_offset)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_mul_z)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_div_z)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_mul_x)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_div_x)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_mul_d)); pos += 8; 
                                snprintf(&sts[pos], 32, "%08lX", uint32_t(stepper_follow_div_d)); pos += 8; 
                            }
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(cycle_counter)); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t((current_run_mode<<16) | (cycle_buffer.index_length()<<8) | (cycle_buffer.index()))); pos += 8; 
                            snprintf(&sts[pos], 32, "%08lX", uint32_t(absolute_tick)); pos += 8; 

