tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
                            uint16_t crc = CRC16(reinterpret_cast<const uint8_t *>(sts), pos);

                            sts[pos++] = char(int2hex[((crc>>12)&0xF)]);
                            sts[pos++] = char(int2hex[((crc>> 8)&0xF)]);
                            sts[pos++] = char(int2hex[((crc>> 4)&0xF)]);
                            sts[pos++] = char(int2hex[((crc>> 0)&0xF)]);
                            sts[pos++] = '\n';

                            // Send the ascii-fied data over UART
                            for (size_t c=0; c<pos; c++) {
                                put_char(sts[c]);
                            }
                        } break;

                default: {
                            send_invalid_response();
                        } break;

            }
            buf_pos = 0;
            break;
        }
    }
}

static void init_constants() 
{
    absolute_pos = 0;
    absolute_idx = 0;
    absolute_tick = 0;
    current_rpm = 0; 

    absolute_pos_start_offset = 0;

    stepper_actual_pos_z = 0;
    
    stepper_follow_mul_z = -60; // 0.1mm/rev
    stepper_follow_div_z = 1143;
    
    stepper_actual_pos_x = 0;
    
    stepper_follow_mul_x = 60 / 2; // 0.05mm/rev
    stepper_follow_div_x = 1143;

    stepper_actual_pos_d = 0;

    stepper_follow_mul_d = 0;
    stepper_follow_div_d = 1;
}

static void init_systick(void)
{
    int tick_time = SystemCoreClock / 1000;  // Generate interrupt each 1 ms
    SysTick_Config(tick_time);               // Configure systick timer
}

static void init_clock(void)
{
#ifdef STM32F103xB
    // Conf clock : 72MHz using HSE 8MHz crystal w/ PLL X 9 (8MHz x 9 = 72MHz)
    FLASH->ACR      |= FLASH_ACR_LATENCY_2; // Two wait states, per datasheet
    RCC->CFGR       |= RCC_CFGR_PPRE1_2;    // prescale AHB1 = HCLK/2
    RCC->CR         |= RCC_CR_HSEON;        // enable HSE clock
    while( !(RCC->CR & RCC_CR_HSERDY) );    // wait for the HSEREADY flag
    
    RCC->CFGR       |= RCC_CFGR_PLLSRC;     // set PLL source to HSE
    RCC->CFGR       |= RCC_CFGR_PLLMULL9;   // multiply by 9
    RCC->CR         |= RCC_CR_PLLON;        // enable the PLL
    while( !(RCC->CR & RCC_CR_PLLRDY) );    // wait for the PLLRDY flag
    
    RCC->CFGR       |= RCC_CFGR_SW_PLL;     // set clock source to pll

    while( !(RCC->CFGR & RCC_CFGR_SWS_PLL) );    // wait for PLL to be CLK
    
    SystemCoreClockUpdate();                // calculate the SYSCLOCK value
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    FLASH->ACR      |= FLASH_ACR_LATENCY_4WS; // Four wait states
    while ((FLASH->ACR & FLASH_ACR_LATENCY) != FLASH_ACR_LATENCY_4WS);

    RCC->CR         |= RCC_CR_HSEON;        // enable HSE clock
    while( !(RCC->CR & RCC_CR_HSERDY) );    // wait for the HSEREADY flag

	//
	// Set to 216Mhz using HSE 8Mhz crystal w/ PLL
	//
	// Default on startup (96Mhz):
	//
	// PLLP  == 2
	// PLLN  == 192
	// PLLM  == 16
	//
	RCC->PLLCFGR &= ~(RCC_PLLCFGR_PLLM); // PLLP = 2
	RCC->PLLCFGR |= RCC_PLLCFGR_PLLM_2; // PLLM = 4
	RCC->PLLCFGR |= RCC_PLLCFGR_PLLN_3 | RCC_PLLCFGR_PLLN_4 | RCC_PLLCFGR_PLLN_6 | RCC_PLLCFGR_PLLN_7; // PLLN = 216;
    RCC->CR |= RCC_CR_PLLON;        // enable the PLL
    while( !(RCC->CR & RCC_CR_PLLRDY) );    // wait for the PLLRDY flag

    RCC->CFGR |= RCC_CFGR_SW_PLL;     // set clock source to pll
    while( !(RCC->CFGR & RCC_CFGR_SWS_PLL) );    // wait for PLL to be CLK

    SystemCoreClockUpdate();                // calculate the SYSCLOCK value
#endif  // #ifdef STM32F767xx
}

static void init_led(void)
{
#ifdef STM32F103xB
    RCC->APB2ENR |= RCC_APB2ENR_IOPCEN; // enable GPIO clock for LED
    LED_PORT->CRH    &= ~(GPIO_CRH_MODE13 | GPIO_CRH_CNF13);  // reset pin MODE / CNF
    LED_PORT->CRH    |=  (GPIO_CRH_MODE13_1 | GPIO_CRH_MODE13_0);    // MODE: 50Mhz ouput CNF: PP
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    RCC->APB1ENR |= RCC_AHB1ENR_GPIOAEN; // enable GPIO clock for LED
#endif  // #ifdef STM32F767xx
}

static void init_usart(uint32_t baudrate)
{
    RCC->APB2ENR |= RCC_APB2ENR_USART1EN; // enable USART1 clock

#ifdef STM32F103xB
    // UART on pins PB6 and PB7
    RCC->APB2ENR    |= RCC_APB2ENR_AFIOEN;  // enable AFIO clock
    RCC->APB2ENR    |= RCC_APB2ENR_IOPAEN | RCC_APB2ENR_IOPBEN | RCC_APB2ENR_IOPCEN;// enable GPIOA, GPIOB, GPIOC clock

    //use AFIO_MAPR register to remap alternate functions to use USART 1 TX and RX on PB6 and PB7
    //Ref 7.4.2 and 6.3.7 in st manual
    AFIO->MAPR |= AFIO_MAPR_USART1_REMAP;
    
    GPIOB->CRL &= ~(GPIO_CRL_CNF6 | GPIO_CRL_MODE6);  // reset PB6
    GPIOB->CRL &= ~(GPIO_CRL_CNF7 | GPIO_CRL_MODE7);  // reset PB7
    
    GPIOB->CRL |= GPIO_CRL_MODE6_1 | GPIO_CRL_MODE6_0;  // 0b11 50MHz output

    GPIOB->CRL |= GPIO_CRL_CNF6_1;    // PB6: output @ 50MHz - Alt-function Push-pull
    GPIOB->CRL |= GPIO_CRL_CNF7_0;    // PB7 RX - Mode = 0b00 (input) - CNF = 0b01 (input floating)
    
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    RCC->APB1ENR |= RCC_AHB1ENR_GPIOAEN; // enable GPIO clock for Port A

    GPIOA->MODER &= ~(GPIO_MODER_MODER9);  // reset PA9
    GPIOA->MODER &= ~(GPIO_MODER_MODER10);  // reset PA10

    GPIOA->MODER |= GPIO_MODER_MODER9_1; // Set to alt mode
    GPIOA->MODER |= GPIO_MODER_MODER10_1; // Set to alt mode

    GPIOA->AFR[1] &= ~(GPIO_AFRH_AFRH1);
    GPIOA->AFR[1] &= ~(GPIO_AFRH_AFRH2);

    GPIOA->AFR[1] |= GPIO_AFRH_AFRH1_0 | GPIO_AFRH_AFRH1_1 | GPIO_AFRH_AFRH1_2; // set to AF7 mode (USART1_TX)
    GPIOA->AFR[1] |= GPIO_AFRH_AFRH2_0 | GPIO_AFRH_AFRH2_1 | GPIO_AFRH_AFRH2_2; // set to AF7 mode (USART1_RX)

#endif  // #ifdef STM32F767xx

    // configure USART1 registers
    uint32_t baud   = (uint32_t)(SystemCoreClock/baudrate);
    USART1->BRR     = baud;
    USART1->CR1     = USART_CR1_TE | USART_CR1_RE | USART_CR1_RXNEIE | USART_CR1_UE;

    // configure NVIC
    NVIC_EnableIRQ(USART1_IRQn);
    NVIC_SetPriority(USART1_IRQn, 255);
}

static void init_qenc()
{
    // setup A/B quadrature on timer 3 periph
    RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;  // enable TIM3 clock

#ifdef STM32F103xB
   // PA6 - A
   // PA7 - B
   // PA1 - Z
    GPIOA->CRL &= ~(GPIO_CRL_CNF6 | GPIO_CRL_MODE6);  // reset PA6
    GPIOA->CRL &= ~(GPIO_CRL_CNF7 | GPIO_CRL_MODE7);  // reset PA7

    GPIOA->CRL |= GPIO_CRL_CNF6_1;
    GPIOA->CRL |= GPIO_CRL_CNF7_1;
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
   // PA6 - A (CN12 -> Pin 13)
   // PA7 - B (CN12 -> Pin 15)
   // PA1 - Z (CN11 -> Pin 30)
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

    GPIOA->MODER &= ~(GPIO_MODER_MODER6);  // reset PA6
    GPIOA->MODER &= ~(GPIO_MODER_MODER7);  // reset PA7

    GPIOA->MODER |= GPIO_MODER_MODER6_1;
    GPIOA->MODER |= GPIO_MODER_MODER7_1;
    
    GPIOA->AFR[0] &= ~(GPIO_AFRL_AFRL6); 
    GPIOA->AFR[0] &= ~(GPIO_AFRL_AFRL7);

    GPIOA->AFR[0] |= GPIO_AFRL_AFRL6_2;
    GPIOA->AFR[0] |= GPIO_AFRL_AFRL7_2;
#endif  // #ifdef STM32F767xx

    TIM3->SR = 0;
    TIM3->CNT = 0;

    TIM3->CCMR1 &= ~(TIM_CCMR1_CC1S); 
    TIM3->CCMR1 |= TIM_CCMR1_CC1S_0; // connect TI1

    TIM3->CCMR1 &= ~(TIM_CCMR1_CC2S);
    TIM3->CCMR1 |= TIM_CCMR1_CC2S_0; // connect TI2

    TIM3->CCER &= ~(TIM_CCER_CC1P);  
    TIM3->CCER &= ~(TIM_CCER_CC1NP); 

    TIM3->CCER &= ~(TIM_CCER_CC2P);
    TIM3->CCER &= ~(TIM_CCER_CC2NP); 

