tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
    TIM3->SMCR &= ~(TIM_SMCR_SMS);
    TIM3->SMCR |= TIM_SMCR_SMS_0 | TIM_SMCR_SMS_1;

    TIM3->CR1  |= TIM_CR1_CEN; // turn on counter

    NVIC_EnableIRQ(TIM3_IRQn);
    NVIC_SetPriority(TIM3_IRQn, 3);

#ifdef STM32F103xB
    // setup Z/Index on pin PA1
    RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;  // enable AFIO clock
    AFIO->EXTICR[0] |= AFIO_EXTICR1_EXTI1_PA; // Select EXT1
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
	RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN; // enable SYCFG clock
    SYSCFG->EXTICR[0] |= SYSCFG_EXTICR1_EXTI1_PA; // Select EXT1
#endif  // #ifdef STM32F767xx

    EXTI->IMR |= EXTI_IMR_MR1;
    EXTI->FTSR |= EXTI_FTSR_TR1;

    // configure NVIC
    NVIC_EnableIRQ(EXTI1_IRQn);
    NVIC_SetPriority(EXTI1_IRQn, 0); // highest/critical priority in system
    
}

static void init_stepper_pins()
{
#ifdef STM32F103xB
    RCC->APB2ENR |= RCC_APB2ENR_IOPBEN | RCC_APB2ENR_IOPAEN; // Enable GPIOB and GPIOA block

    // Z - enable
    GPIOB->CRH &= ~(GPIO_CRH_MODE12 | GPIO_CRH_CNF12);
    GPIOB->CRH |= GPIO_CRH_MODE12_1 | GPIO_CRH_MODE12_0;
    PIN_ENA_0_X; // set to low enables driver

    // Z - pulse/step
    GPIOB->CRH &= ~(GPIO_CRH_MODE13 | GPIO_CRH_CNF13);
    GPIOB->CRH |= GPIO_CRH_MODE13_1 | GPIO_CRH_MODE13_0;
    PIN_PUL_1_Z;

    // Z - dir
    GPIOB->CRH &= ~(GPIO_CRH_MODE14 | GPIO_CRH_CNF14);
    GPIOB->CRH |= GPIO_CRH_MODE14_1 | GPIO_CRH_MODE14_0;
    PIN_DIR_1_Z;

    // X - enable
    GPIOB->CRH &= ~(GPIO_CRH_MODE15 | GPIO_CRH_CNF15);
    GPIOB->CRH |= GPIO_CRH_MODE15_1 | GPIO_CRH_MODE15_0;
    PIN_ENA_0_X; // set to low enables driver

    // X - pulse/step
    GPIOB->CRH &= ~(GPIO_CRH_MODE11 | GPIO_CRH_CNF11);
    GPIOB->CRH |= GPIO_CRH_MODE11_1 | GPIO_CRH_MODE11_0;
    PIN_PUL_1_X;

    // X - dir
    GPIOB->CRL &= ~(GPIO_CRL_MODE5 | GPIO_CRL_CNF5);
    GPIOB->CRL |= GPIO_CRL_MODE5_1 | GPIO_CRL_MODE5_0;
    PIN_DIR_1_X;
#endif   // #ifdef STM32F103xB

#ifdef STM32F767xx
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;

    // Z - enable
    GPIOE->MODER &= ~(GPIO_MODER_MODER9); 
    GPIOE->MODER |= GPIO_MODER_MODER9_1; // output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR9); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR9_1; // high speed 
    PIN_ENA_0_X; // set to low enables driver

    // Z - pulse/step
    GPIOE->MODER &= ~(GPIO_MODER_MODER10); 
    GPIOE->MODER |= GPIO_MODER_MODER10_1;// output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR10); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR10_1; // high speed 
    PIN_PUL_1_Z;

    // Z - dir
    GPIOE->MODER &= ~(GPIO_MODER_MODER11); 
    GPIOE->MODER |= GPIO_MODER_MODER11_1;// output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR11); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR11_1; // high speed  
    PIN_DIR_1_Z;

    // X - enable
    GPIOE->MODER &= ~(GPIO_MODER_MODER12); 
    GPIOE->MODER |= GPIO_MODER_MODER12_1;// output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR12); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR12_1; // high speed 
    PIN_ENA_0_X; // set to low enables driver

    // X - pulse/step
    GPIOE->MODER &= ~(GPIO_MODER_MODER13);
    GPIOE->MODER |= GPIO_MODER_MODER13_1;// output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR13); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR13_1; // high speed 
    PIN_PUL_1_X;

    // X - dir
    GPIOE->MODER &= ~(GPIO_MODER_MODER14);
    GPIOE->MODER |= GPIO_MODER_MODER14_1;// output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR14); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR14_1; // high speed 
    PIN_DIR_1_X;
#endif   // #ifdef STM32F767xx
}

static void init_stepper_sync_timer()
{
    RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;  // enable TIM2 clock

    TIM2->CR1 |= TIM_CR1_ARPE | TIM_CR1_URS;
    TIM2->PSC = 1;
    TIM2->ARR = one_active_axis_timer; // This seems to be working fine at 1200rpm and 1:1 ratio
    TIM2->DIER |= TIM_DIER_UIE;
    TIM2->EGR = TIM_EGR_UG; // Generate Update Event to copy ARR to its shadow
    TIM2->CR1 |= TIM_CR1_CEN;

    NVIC_EnableIRQ(TIM2_IRQn);
    NVIC_SetPriority(TIM2_IRQn, 1); // second highest priority in system
}

void init_cycle_counter() {
    volatile uint32_t *DEMCR = (uint32_t *)0xE000EDFC;
    volatile uint32_t *DWT_LAR = (uint32_t *)0xE0001FB0;
    volatile uint32_t *DWT_CONTROL = (uint32_t *)0xE0001000;

    *DEMCR |= 0x01000000;
    *DWT_LAR = 0xC5ACCE55; 
    *DWT_CONTROL |= 1;
}

static void init_watchdog(void)
{
    // enable watchdog
    IWDG->KR  = 0xCCCC;
    IWDG->KR  = 0x5555;

    // 1s watchdog
    IWDG->PR  = 1; // 32kHz / 8
    IWDG->RLR = 0xFFF; // *4095 = 1.02375s
}

static void init_hardware(void)
{ 
    init_constants();
    init_clock();
    init_cycle_counter();
    init_led();
    init_usart(USART_BAUD);
    init_systick();
    init_qenc();
    init_stepper_pins();
    init_stepper_sync_timer();
    init_watchdog();
}

int main(void) 
{
    init_hardware();
    set_current_run_mode(run_mode_follow_z);
    while (1) {
        switch(led_state)
        {
            case led_on:
                led_state       = led_idle;
                led_state_next  = led_off;
                LED_PORT->BSRR  = LED_SET;
                break;
                
            case led_off:
                led_state       = led_idle;
                led_state_next  = led_on;
                LED_PORT->BSRR  = LED_RESET;
                break;
                
            default:
                break;
        }
        __WFI();
    }
    return 0;
}

